app/views/notes/_form.html.erb

    <%= f.label :user_id %><br>
    <%= collection_select :note, :user_id, User.all, :id, :username %>
---
SELECT "users".* FROM "users"