app/views/friendships/_form.html.erb

      <%= f.hidden_field :friend_id, :value => params[:friend_id] %>
      Friend user is <%= User.find(params[:friend_id]).email %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]