app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"

  def show
    @friendship = Friendship.find(params[:id])
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @friendship = Friendship.find(params[:id])
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @friendship = Friendship.new(friendship_params)

    respond_to do |format|
      if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["status", "oneway"], ["created_at", "2015-05-08 05:36:39.725815"], ["updated_at", "2015-05-08 05:36:39.725815"]]