app/controllers/notes_controller.rb

  def edit
    @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "testing now"], ["user_id", 5], ["created_at", "2015-04-05 22:52:44.315580"], ["updated_at", "2015-04-05 22:52:44.315580"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "testing now again"], ["updated_at", "2015-04-05 23:01:23.942918"], ["id", 1]]