app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Taylor Wuerker"], ["username", "test"], ["email", "test2"], ["created_at", "2015-04-05 22:13:24.926566"], ["updated_at", "2015-04-05 22:13:24.926566"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Jane Doe"], ["username", "jdoe"], ["updated_at", "2015-05-08 06:39:32.369614"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)